src/InformationRegisters/ИТСервисы_СостоянияЛицензий/ИТСервисы_СостоянияЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_СостоянияЛицензий</name>
  <resources>
    <name>ДнейДоОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>CatalogRef.ИТСервисы_ЛицензииПО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ИТСервисы_ВызовСервера/Module.bsl
Функция ПолучитьДанныеЛицензийКоторыеИстекают() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|   СостоянияЛицензий.Лицензия КАК Лицензия,
		|   ПРЕДСТАВЛЕНИЕ(СостоянияЛицензий.Лицензия) КАК ПредставлениеЛицензии,
		|   СостоянияЛицензий.ДнейДоОкончания КАК ДнейДоОкончания
		|ИЗ
		|   РегистрСведений.ИТСервисы_СостоянияЛицензий КАК СостоянияЛицензий
		|ГДЕ
		|   СостоянияЛицензий.ДнейДоОкончания <= &ДнейДоУведомления";
	
	Запрос.УстановитьПараметр("ДнейДоУведомления", 15);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ДанныеСтроки = Новый Структура("Лицензия, ПредставлениеЛицензии, ДнейДоОкончания", 
			Выборка.Лицензия, // Теперь ссылка передается на клиент!
			Выборка.ПредставлениеЛицензии, 
			Выборка.ДнейДоОкончания);
		Результат.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции
